## 📋 Plan Result (scheduling)

### 🔄 Execution Steps

| Step | Status |
|------|--------|
| 🎨 **Format Check** | ✅ Passed |
| ✅ **Validation** | ✅ Passed |
| 🚀 **Init** | ✅ Passed |
| 📋 **Plan** | 🔄 Changes Detected |

🔄 **Infrastructure changes detected**

```
Plan: 22 to add, 0 to change, 0 to destroy.
```

### 📊 Resource Summary

| Type | Count |
|------|-------|
| ➕ **To Add** | 22 |
| 🔄 **To Change** | 0 |
| ❌ **To Destroy** | 0 |

<details><summary>📋 Show Full Plan Output</summary>

```terraform
module.custom_lambda.module.user_action_filter_function.data.external.archive_prepare[0]: Reading...
module.custom_lambda.module.user_action_filter_function.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.custom_lambda.module.user_action_filter_function.data.aws_caller_identity.current: Reading...
data.aws_sns_topic.my_sns: Reading...
data.aws_kms_key.my_kms: Reading...
module.custom_domain.data.aws_route53_zone.mydomain: Reading...
module.custom_lambda.module.user_action_filter_function.data.aws_partition.current: Reading...
module.custom_nlb.module.nlb.data.aws_partition.current: Reading...
module.custom_lambda.module.user_action_filter_function.data.aws_iam_policy_document.assume_role[0]: Reading...
module.custom_lambda.module.user_action_filter_function.data.aws_partition.current: Read complete after 0s [id=aws]
module.custom_nlb.module.nlb.data.aws_partition.current: Read complete after 0s [id=aws]
module.custom_lambda.module.user_action_filter_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
data.aws_iam_role.task_execution_role: Reading...
data.aws_vpc.myvpc: Reading...
data.aws_iam_role.task_role: Reading...
module.custom_lambda.module.user_action_filter_function.data.aws_region.current: Reading...
data.aws_security_group.fargate_sg: Reading...
module.custom_lambda.module.user_action_filter_function.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.custom_lambda.module.user_action_filter_function.data.aws_caller_identity.current: Read complete after 0s [id=528163014577]
data.aws_iam_role.task_execution_role: Read complete after 0s [id=minecraft-keeping-ecs_tasks_execution-role]
data.aws_iam_role.task_role: Read complete after 0s [id=ecs_tasks-minecraft-keeping-role]
data.aws_kms_key.my_kms: Read complete after 0s [id=c1de0496-4495-4d96-a5e3-047113b0079c]
data.aws_security_group.fargate_sg: Read complete after 0s [id=sg-08a305510ad2def80]
data.aws_sns_topic.my_sns: Read complete after 0s [id=arn:aws:sns:ap-northeast-1:528163014577:minecraft-keeping-sns-topic]
module.custom_domain.data.aws_route53_zone.mydomain: Read complete after 0s [id=Z006257634KDWA8TCRYLE]
data.aws_vpc.myvpc: Read complete after 1s [id=vpc-074f145b68c9843dc]
data.aws_subnets.my_subnets: Reading...
data.aws_subnets.my_subnets: Read complete after 0s [id=ap-northeast-1]
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
<= read (data resources)
Terraform planned the following actions, but then encountered a problem:
# module.custom_cloudwatch.aws_cloudwatch_log_group.firelens will be created
+ resource "aws_cloudwatch_log_group" "firelens" {
+ arn               = (known after apply)
+ id                = (known after apply)
+ log_group_class   = (known after apply)
+ name              = "/aws/ecs/minecraft-firelens-logs"
+ name_prefix       = (known after apply)
+ region            = "ap-northeast-1"
+ retention_in_days = 14
+ skip_destroy      = false
+ tags_all          = (known after apply)
}
# module.custom_cloudwatch.aws_cloudwatch_metric_alarm.target_group_health_check will be created
+ resource "aws_cloudwatch_metric_alarm" "target_group_health_check" {
+ actions_enabled                       = true
+ alarm_actions                         = [
+ "arn:aws:sns:ap-northeast-1:528163014577:minecraft-keeping-sns-topic",
]
+ alarm_description                     = "This metric monitors ecs health status"
+ alarm_name                            = "minecraft-test-targetgroup_healthy"
+ arn                                   = (known after apply)
+ comparison_operator                   = "GreaterThanThreshold"
+ dimensions                            = (known after apply)
+ evaluate_low_sample_count_percentiles = (known after apply)
+ evaluation_periods                    = 1
+ id                                    = (known after apply)
+ metric_name                     

... (content truncated due to length) ...

ply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "environment"           = "test"
          + "owners"                = "minecraft"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all               = {
          + "environment"           = "test"
          + "owners"                = "minecraft"
          + "terraform-aws-modules" = "alb"
        }
      + to_port                = 25565
    }

  # module.custom_nlb.module.nlb.aws_vpc_security_group_ingress_rule.this["map_tcp"] will be created
  + resource "aws_vpc_security_group_ingress_rule" "this" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "TCP traffic"
      + from_port              = 8080
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + region                 = "ap-northeast-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "environment"           = "test"
          + "owners"                = "minecraft"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all               = {
          + "environment"           = "test"
          + "owners"                = "minecraft"
          + "terraform-aws-modules" = "alb"
        }
      + to_port                = 8080
    }

Plan: 22 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + nlb_target_group_arns     = [
      + (known after apply),
      + (known after apply),
    ]
  + target_group_arn_suffixes = [
      + (known after apply),
      + (known after apply),
    ]

╷
│ Error: Invalid function argument
│
│   on variables.tf line 86, in locals:
│   86:   merged_decoded_yaml = merge([for f in var.env_files : yamldecode(file(f))]...)
│
│ Invalid value for "path" parameter: no file exists at "secrets.yaml"; this
│ function works only with files that are distributed as part of the
│ configuration source code, so if this file will be created by a resource in
│ this configuration you must instead obtain this result from an attribute of
│ that resource.
╵

exit status 1
ERROR: terraform invocation failed in ./.terragrunt-cache/YE01qm_OOdyZBB8xumDNc5aEB1U/_4MtXHYCWA2GAoCPiNJgp6-wA8E/scheduling stderr=
╷
│ Error: Invalid function argument
│
│   on variables.tf line 86, in locals:
│   86:   merged_decoded_yaml = merge([for f in var.env_files : yamldecode(file(f))]...)
│
│ Invalid value for "path" parameter: no file exists at "secrets.yaml"; this
│ function works only with files that are distributed as part of the
│ configuration source code, so if this file will be created by a resource in
│ this configuration you must instead obtain this result from an attribute of
│ that resource.
╵

ERROR: 1 error occurred:
	* [./.terragrunt-cache/YE01qm_OOdyZBB8xumDNc5aEB1U/_4MtXHYCWA2GAoCPiNJgp6-wA8E/scheduling] exit status 1
```

</details>

### 🔗 Links

- 📊 **[View GitHub Actions Run](https://github.com/ShotaroMatsuya/minecraft-server-automation/actions/runs/16871851434)**
- 📦 **[Download Artifacts](https://github.com/ShotaroMatsuya/minecraft-server-automation/actions/runs/16871851434#artifacts)**
- 🔍 **[View Terragrunt Plan Job](https://github.com/ShotaroMatsuya/minecraft-server-automation/actions/runs/16871851434/job/comment-results)**

*📋 Plan executed at 2025-08-11T05:42:57.709Z | Environment: scheduling*